Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: བཅོམ་ལྡན་འདས་རང་བཞིན་ལ་ནི་རང་བཞིན་གནས་པ་མ་མཆིས་ན། བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། སེམས་ཅན་རྣམས་ཡང་དག་པའི་མཐའ་ལ་འགོད་པ་ལགས།
en: Blessed Lord, since the essential nature cannot be established in the essential nature, how then, Blessed Lord, when bodhisattva great beings practice the perfection of wisdom, do they establish beings in the very limit of reality?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་ཡང་དག་པའི་མཐའ་ལ་ཡང་དག་པའི་མཐའ་གནས་པར་འགྱུར་བ་ཡང་མེད་དོ།
en: Subhūti,” replied the Blessed One, “the very limit of reality is indeed not established in the very limit of reality.

source: །རང་བཞིན་ལ་རང་བཞིན་གནས་པར་འགྱུར་བ་ཡང་མེད་ན།
en: Nor is the essential nature established in the essential nature.

source: འོན་ཀྱང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཐབས་མཁས་པས་སེམས་ཅན་གྱི་མཐའ་ཡང་དག་པའི་མཐའ་ལ་འགོད་དེ། ཡང་དག་པའི་མཐའ་རྣམ་པར་འཁྲུག་པར་མི་བྱེད་དོ།
en: And yet, when bodhisattva great beings practice the perfection of wisdom, through skill in means they do establish the very limit of beings in the very limit of reality, and they do not disturb the very limit of reality.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། སེམས་ཅན་གྱི་མཐའ་ཡང་གཞན་མ་ཡིན།
en: If you ask why, the very limit of beings is not one thing and the very limit of reality another.

source: ཡང་དག་པའི་མཐའ་ཡང་གཞན་མ་ཡིན་ཏེ། དེ་ལྟར་ན་སེམས་ཅན་གྱི་མཐའ་དང་ཡང་དག་པའི་མཐའ་དེ་ལ་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་དོ། །གསོལ་པ།
en: So, the very limit of beings and the very limit of reality are indivisible and cannot be divided in two.” “

source: བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཐབས་མཁས་པ་དང་ལྡན་པས། སེམས་ཅན་རྣམས་ཡང་དག་པའི་མཐའ་ལ་འགོད་ཀྱང་ཡང་དག་པའི་མཐའ་རྣམ་པར་འཁྲུག་པར་མི་བགྱིད་པ་དེ་ལྟ་བུའི་ཐབས་གང་ལགས། བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: Blessed Lord, when bodhisattva great beings practice the perfection of wisdom, what is the skill in means endowed with which they establish beings in the very limit of reality but do not disturb the very limit of reality?” “

source: རབ་འབྱོར་འདི་ལ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། སེམས་དང་པོ་བསྐྱེད་པ་ནས་ཉེ་བར་བཟུང་སྟེ། སེམས་ཅན་རྣམས་སྦྱིན་པ་ལ་རབ་ཏུ་འགོད་དོ། །སྦྱིན་པ་དེ་ལ་རབ་ཏུ་བཀོད་ནས། སྦྱིན་པ་དེའི་ཐོག་མའི་མཐའ་དང་།
en: In this regard, Subhūti,” replied the Blessed One, “when bodhisattva great beings practice the perfection of wisdom, commencing from their first setting of the mind on enlightenment, they establish beings in generosity.

source: ཐ་མའི་མཐའ་དང་། དབུས་སྟོང་སྟེ། ཇི་ལྟར་སྦྱིན་པ་དེའི་ཐོག་མའི་མཐའ་ཡང་སྟོང་། ཐ་མའི་མཐའ་ཡང་སྟོང་། དབུས་ཀྱང་སྟོང་བ་དེ་ལྟར་སྦྱིན་པའི་འབྲས་བུ་ཡང་སྟོང་།
en: Having established them in generosity, they reveal that, ‘Generosity is empty in the beginning, in the end, and in the middle, and just as that generosity is empty in the beginning, empty in the end, and empty in the middle, so too is the fruit of that generosity empty; the donor is also empty and the recipient is also empty. {

source: སྦྱིན་བདག་ཀྱང་སྟོང་།
en: Ki.

source: ལེན་པ་ཡང་སྟོང་བར་སྟོན་ཅིང་། རིགས་ཀྱི་བུ་དེ་ལྟར་ཡང་དག་པའི་མཐའ་ལ་དོན་དེ་དག་མེད་ཀྱིས།
en: VIII: 90} So it is, noble children, that these concepts are not discerned in the very limit of reality.

source: སྦྱིན་པ་ཡང་གཞན་ལ། སྦྱིན་པའི་འབྲས་བུ་ཡང་གཞན་ནོ་སྙམ་དུ་མ་སེམས་ཤིག །
en: Do not think that generosity is one thing and the fruit of generosity another!

source: སྦྱིན་བདག་ཀྱང་གཞན་ལ། ལེན་པ་ཡང་གཞན་ནོ། སྙམ་དུ་མ་སེམས་ཤིག །
en: Do not think that the donor is one thing and the recipient another.

source: རིགས་ཀྱི་བུ་ཁྱོད་ནམ་སྦྱིན་པ་ཡང་གཞན་ལ། སྦྱིན་པའི་འབྲས་བུ་ཡང་གཞན་ནོ་སྙམ་དུ་མི་སེམས། སྦྱིན་བདག་ཀྱང་གཞན་ལ། ལེན་པ་ཡང་གཞན་ནོ་སྙམ་དུ་མི་སེམས་པ་དེའི་ཚེ། ཁྱོད་ཀྱི་སྦྱིན་པ་འདི་བདུད་རྩི་དང་།
en: Noble children, when you do not think that generosity is one thing and the fruit of generosity another, and when you do not think that the donor is one thing and the recipient another, this generosity of yours will become [deathless] nectar, the fruit of [deathless] nectar, and it will terminate in [deathless] nectar.

source: བདུད་རྩིའི་འབྲས་བུ་དང་། མཐར་བདུད་རྩིར་འགྱུར་ཏེ། སྦྱིན་པ་འདིས་གཟུགས་ཡོངས་སུ་མ་འཛིན་ཅིག །
en: But through this generosity, you should not appropriate physical forms!

source: ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ཡོངས་སུ་མ་འཛིན་ཅིག །
en: Do not appropriate feelings, perceptions, formative predispositions, and consciousness!

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདི་ལྟར་ཁྱོད་ཀྱི་སྦྱིན་པ་འདི་ནི་སྦྱིན་པས་སྟོང་ངོ་། །དེའི་འབྲས་བུ་ཡང་འབྲས་བུས་སྟོང་ངོ་། །སྦྱིན་བདག་ཀྱང་སྦྱིན་བདག་གིས་སྟོང་ངོ་། །ལེན་པ་ཡང་ལེན་པས་སྟོང་སྟེ།
en: If you ask why, it is because this generosity of yours is empty of generosity, its fruit is also empty of its fruit, the donor is also empty of the donor, and the recipient is also empty of the recipient.

source: སྟོང་པ་ཉིད་ལ་ནི་སྦྱིན་པ་མི་དམིགས། སྦྱིན་པའི་འབྲས་བུ་དང་། སྦྱིན་བདག་དང་། ལེན་པ་མི་དམིགས་སོ།
en: In emptiness, generosity is not apprehended, nor are the fruit of generosity, the donor, or the recipient apprehended.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདི་ལྟར་ཆོས་དེ་དག་ནི་ངོ་བོ་ཉིད་ཀྱིས་ཤིན་དུ་སྟོང་ངོ་ཞེས་རྗོད་དོ།
en: If you ask why, it is because these phenomena are said to be absolutely empty of inherent existence.’ “

source: །གཞན་ཡང་རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཐབས་མཁས་པས་སེམས་ཅན་རྣམས་ཚུལ་ཁྲིམས་ལ་འགོད་དེ། ཚུར་རིགས་ཀྱི་བུ་སྲོག་གཅོད་པ་སྤོངས་ལ།
en: Moreover, Subhūti, when bodhisattva great beings practice the perfection of wisdom, they establish beings in ethical discipline through skill in means, saying, ‘Come here, noble children.

source: སྲོག་གཅོད་པ་ལས་ཕྱིར་ལྡོག་པར་གྱིས་ཤིག །མ་བྱིན་པར་ལེན་པ་དང་།
en: As well as abstaining from the killing of living creatures, remove yourselves from the killing of living creatures.

source: འདོད་པས་ལོག་པར་གཡེམ་པ་དང་། བརྫུན་དུ་སྨྲ་བ་དང་། ཕྲ་མ་དང་། ཞེ་གཅོད་པ་དང་། ཚིག་ཀྱལ་པ་དང་། ཆགས་སེམས་དང་། གནོད་སེམས་དང་།
en: As well as abstaining from stealing, sexual misconduct, falsehood, slander, verbal abuse, nonsensical chatter, covetousness, malice, and wrong views, remove yourselves from wrong views [and so forth].

source: གང་ལོག་པར་ལྟ་བ་སྤོངས་ལ་ལོག་པར་ལྟ་བ་ལས་ཕྱིར་ལྡོག་པར་གྱིས་ཤིག །རིགས་ཀྱི་བུ་ཆོས་འདི་དག་ལ་ཇི་ལྟར་ཡོངས་སུ་བརྟགས་པ་དེ་ལྟ་བུའི་རང་བཞིན་གང་ཡང་མེད་ཀྱིས། རིགས་ཀྱི་བུ་སོམས་དང་། གང་གི་སྲོག་གཅད་པར་བྱ་བའི་སྲོག་ཆགས་དང་། གང་སྲོག་གཅད་པར་བྱ་བ་དེ་ལྟ་བུའི་ཆོས་ཀྱང་གང་ཞིག་ཡིན། གང་མ་བྱིན་པར་ལེན་པ་དང་། འདོད་པས་ལོག་པར་གཡེམ་པ་དང་། བརྫུན་དུ་སྨྲ་བ་དང་། ཕྲ་མ་དང་། ཞེ་གཅོད་པའི་ཚིག་དང་། ཚིག་ཀྱལ་པ་དང་། ཆགས་སེམས་དང་། གནོད་སེམས་དང་། གང་ལོག་པར་ལྟ་བ་དང་། ལོག་པར་ལྟ་བར་བཏགས་པ་དང་། གང་གིས་ལོག་པར་ལྟ་བར་བཏགས་པ་དང་། གང་གིས་ལོག་པར་མཐོང་བ་དེ་ལྟ་བུའི་ཆོས་ཀྱང་གང་ཞིག་ཡིན་ཞེས་སྟོན་ཅིང་། ཚུལ་ཁྲིམས་ལ་འགོད་དེ།
en: Noble children, since no inherent existence is discerned with respect to these phenomena, such as you have imagined, noble children, you should reflect on and disclose [to others] what are the living creatures whose life is to be killed, or the sorts of things by which they are to be killed; what are stealing, sexual misconduct, falsehood, slander, hard words, nonsensical chatter, covetousness, malice, and wrong views; what is designated as wrong views [and so forth]; by what are wrong views [and so forth] designated; and who is it who has wrong views [and so forth], and then you should establish them in ethical discipline.’ “

source: རབ་འབྱོར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཐབས་མཁས་པ་དེ་ལྟ་བུ་དང་ལྡན་པས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱེད་དོ། །དེས་དེ་ལ་སྦྱིན་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་འབྲས་བུ་བསྟན་ཏེ།
en: Subhūti, when bodhisattva great beings practice the perfection of wisdom, endowed with such skill in means they bring beings to maturation, and they reveal to them generosity and the fruit of ethical discipline.

source: སྦྱིན་པའི་འབྲས་བུ་དང་། ཚུལ་ཁྲིམས་ཀྱི་འབྲས་བུ་དེ་ཡང་ངོ་བོ་ཉིད་ཀྱིས་སྟོང་པར་བསྟན་པས། རིགས་ཀྱི་བུ་དེས་སྦྱིན་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་འབྲས་བུ་ངོ་བོ་ཉིད་ཀྱིས་སྟོང་པར་རིག་ནས།
en: That is to say, by revealing that the fruit of generosity and the fruit of ethical discipline are also empty of inherent existence, those noble children come to know that generosity, [ethical discipline], and the fruit of [generosity and] ethical discipline are empty of inherent existence, {Ki.

source: དེ་ལ་མངོན་པར་ཞེན་པར་མི་བྱེད་དོ།
en: VIII: 91} and they are not fixated upon them.

source: །མངོན་པར་ཞེན་པ་མེད་པས་འཁྲུག་པར་མི་འགྱུར་ཞིང་ཤེས་རབ་སྐྱེད་དོ། །ཤེས་རབ་དེས་ཀྱང་བག་ལ་ཉལ་བ་དང་།
en: Since they are without fixation, they will not be disturbed, and they will develop wisdom.

source: ཀུན་ནས་ལྡང་བ་ཐམས་ཅད་བཅད་ནས། ཕུང་པོ་མ་ལུས་པའི་མྱ་ངན་ལས་འདས་པའི་དབྱིངས་སུ་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་སྟེ།
en: Through that wisdom they sever all latent impulses and obsessions and attain final nirvāṇa in the expanse of nirvāṇa where there is no residue of the psycho-physical aggregates.

source: དེ་ཡང་འཇིག་རྟེན་གྱི་ཐ་སྙད་ཀྱི་དོན་དམ་པར་མ་ཡིན་ནོ།
en: That [result, however,] accords with mundane convention but not with ultimate reality.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། སྟོང་པ་ཉིད་ལ་གང་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བ་འམ། ཡོངས་སུ་མྱ་ངན་ལས་འདས་པ་ཞེས་བྱ་བ་དེ་ལྟ་བུའི་ཆོས་གང་ཡང་མི་དམིགས་ཏེ།
en: If you ask why, in emptiness nothing at all is apprehended that would attain final nirvāṇa or has attained final nirvāṇa.

source: དེའི་མྱ་ངན་ལས་འདས་པ་ཞེས་བྱ་བ་ནི་འདི་ལྟ་སྟེ། མཐའ་ལས་འདས་པ་སྟོང་པ་ཉིད་དོ།
en: That which is termed their nirvāṇa is actually the emptiness of the unlimited. “

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། སེམས་ཅན་ཕན་ཚུན་གནོད་པར་སེམས་ཤིང་། འཁྲུགས་པར་གྱུར་པ་དང་ལྡན་པ་དག་མཐོང་ན། འདི་སྐད་དུ་འདེམས་ཤིང་སྟོན་ཏེ། རིགས་ཀྱི་བུ་བཟོད་པ་སྒྲུབས་ཤིག །
en: Moreover, Subhūti, when bodhisattva great beings practice the perfection of wisdom, if they see beings who are disturbed with thoughts of malice toward one another, they should instruct and advise them as follows: ‘Noble children, practice tolerance!

source: བཟོད་པ་སྒོམས་ཤིག །
en: Cultivate tolerance!

source: དེས་པ་དང་། སེམས་ཞི་བ་དང་། དང་དུ་སེམས་པའི་ངང་ཚུལ་ཅན་དུ་གྱིས་ཤིག །
en: Maintain a disposition of serenity, peace, and clarity!

source: གང་གནོད་པར་བྱེད་པ་དང་། གང་གིས་གནོད་པར་བྱ་བ་དང་། གང་ལ་གནོད་པར་བྱ་བའི་ཆོས་དེ་དག་ནི། ཐམས་ཅད་ཀྱང་རང་བཞིན་གྱིས་སྟོང་པ་ཡིན་གྱིས།
en: One who inflicts harm, the means through which harm is inflicted, and the victim who is harmed—all these are indeed empty of inherent existence.

source: རིགས་ཀྱི་བུ་གནོད་པར་བྱེད་པ་ནི་སུ་ཡོད། གནོད་པར་ནི་སུ་ལ་བྱ།
en: Therefore, noble children, consider who is inflicting herm, on whom is harm being inflicted, and through what means is harm being inflicted.

source: ཅིས་ནི་གནོད་པར་བྱ་སོམས་དང་ཆོས་དེ་དག་ཐམས་ཅད་རང་བཞིན་གྱིས་སྟོང་པ་སྟེ།
en: All these are empty of inherent existence.

source: རང་བཞིན་གྱིས་སྟོང་པ་ཉིད་གང་ཡིན་པ་དེ་ནི་ནམ་ཡང་མི་སྟོང་བར་མི་འགྱུར་ཏེ།
en: It is never the case that the emptiness of inherent existence not empty!

source: དེ་ནི་དེ་བཞིན་གཤེགས་པ་རྣམས་ཀྱིས་མ་མཛད་དོ། །བྱང་ཆུབ་སེམས་དཔའ་དང་།
en: It has not been created by the tathāgatas.

source: རང་སངས་རྒྱས་དང་། ཉན་ཐོས་རྣམས་ཀྱིས་མ་བྱས་སོ། །ལྷ་དང་ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་།
en: It has not been created by the bodhisattvas, the pratyekabuddhas, or the śrāvakas.

source: ལྷ་མ་ཡིན་དང་། ནམ་མཁའ་ལྡིང་དང་། མི་འམ་ཅི་དང་ལྟོ་འཕྱེ་ཆེན་པོ་རྣམས་ཀྱིས་མ་བྱས་སོ། །རྒྱལ་ཆེན་བཞིའི་རིས་ཀྱི་ལྷ་རྣམས་ཀྱིས་མ་བྱས་སོ། །སུམ་ཅུ་རྩ་གསུམ་དང་། མཚེ་མ་དང་། དགའ་ལྡན་དང་། འཕྲུལ་དགའ་དང་། གཞན་འཕྲུལ་དབང་བྱེད་དང་། ཚངས་པ་དང་། དགེ་རྒྱས་དང་།
en: It has not been created by gods, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, or mahoragas.

source: གནས་གཙང་མ་དང་། ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་དང་། རྣམ་ཤེས་མཐའ་ཡས་སྐྱེ་མཆེད་དང་། ཅུང་ཟད་མེད་པའི་སྐྱེ་མཆེད་དང་། འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་སྐྱེ་མཆེད་ཀྱི་ལྷ་རྣམས་ཀྱིས་མ་བྱས་ཏེ།
en: It has not been created by the gods of the Caturmahā­rāja­kāyika realm, and it has not been created by the gods of Trayastriṃśa, Yāma, Tuṣita, Nirmāṇarata, or Para­nirmita­vaśa­vartin; the Brahmā realms; Śubhakṛtsna; the Pure Abodes; or the sphere of infinite space, the sphere of infinite consciousness, the sphere of nothing-at-all, or the sphere of neither perception nor nonperception.

source: དེ་ནི་རྟག་པར་ཡང་རང་བཞིན་གྱིས་སྟོང་པའོ།
en: It is always empty of inherent existence.

source: །རང་བཞིན་གྱིས་སྟོང་པ་ནི་སུ་ལ་ཡང་གནོད་པར་མི་བྱེད་དོ་ཞེས་ནས།
en: That which is empty of inherent existence does not inflict harm on anyone.’

source: རབ་འབྱོར་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་ཅིང་། སེམས་ཅན་རྣམས་ཐབས་མཁས་པས། རང་བཞིན་གྱིས་སྟོང་པ་ཉིད་དང་། རྒྱུ་དང་འབྲས་བུ་ལ་སྦྱོར་ཏེ། རང་བཞིན་སྟོང་པ་ཉིད་ལ་བཀོད་ཅིང་།
en: It is in this manner, Subhūti, that bodhisattva great beings practice the perfection of wisdom and establish beings through skill in means in the emptiness of inherent existence—in the emptiness of inherent existence that applies to both causes and fruits.

source: རིམ་གྱིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཡང་དག་པར་སྟོན་ཏོ། །ཡང་དག་པར་སྐུལ་ལོ། །ཡང་དག་པར་གཟེང་བསྟོད་དོ། །ཡང་དག་པར་དགའ་བར་བྱེད་དོ། །གཞོག་གོ །འདུལ་ལོ།
en: Gradually they reveal to them unsurpassed, complete enlightenment, and encourage them, praise them, rejoice with them, settle them, discipline them, and establish them in it.

source: །རབ་ཏུ་འགོད་དོ།
en: That, however, accords with mundane convention {Ki.

source: །དེ་ཡང་འཇིག་རྟེན་གྱི་ཐ་སྙད་ཀྱི་དོན་དམ་པར་ནི་མ་ཡིན་ནོ།
en: VIII: 92} and not with ultimate reality.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རང་བཞིན་སྟོང་པ་ཉིད་ལ་གང་ཐོབ་པར་བྱེད་པ་དང་། གང་གིས་ཐོབ་པར་བྱ་བ་དང་། གང་ཐོབ་པར་བྱ་བ་གང་ཡང་མེད་དོ།
en: If you ask why, in emptiness there is no one who attains, nothing by which attainment is brought about, and nothing at all that is attained.

source: །རབ་འབྱོར་འདི་ནི་ཡང་དག་པའི་མཐའ་སྟོང་པ་ཉིད་དེ།
en: This, Subhūti, is the very limit of reality, the emptiness [of inherent existence].

source: དེ་ལ་གནས་ཤིང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སེམས་ཅན་རྣམས་ཀྱི་དོན་དུ་གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་དེ། དེ་ལ་སེམས་ཅན་དུ་དམིགས་པ་མེད་དོ། །སེམས་ཅན་དུ་གདགས་པ་དམིགས་སུ་མེད་དོ།
en: Abiding in it, bodhisattva great beings practice the perfection of wisdom for the sake of beings, but in it beings are not apprehended, nor is the concept ‘being’ apprehended.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། འདི་ལྟར་ཆོས་ཐམས་ཅད་ནི་སེམས་ཅན་གྱིས་དབེན་པའོ།
en: If you ask why, it is because all phenomena are void of beings. “

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཐབས་མཁས་པས་སེམས་ཅན་ལེ་ལོ་ཅན་བརྩོན་འགྲུས་ཆུང་བ་དག་མཐོང་ན། འདི་ལྟར་ལུས་དང་སེམས་ཀྱི་བརྩོན་འགྲུས་ལ་ཡང་དག་པར་བསྐུལ་ཏེ། རིགས་ཀྱི་བུ་དག་རང་བཞིན་གྱིས་སྟོང་པ་ཉིད་ལ་ནི་ཆོས་གང་ཡང་ཞུམ་ཞིང་ལེ་ལོར་འགྱུར་བ་འམ། གང་ལ་ཞུམ་ཞིང་ལེ་ལོར་འགྱུར་བའི་ཆོས་གང་ཡང་མེད་དེ།
en: Moreover, Subhūti, when bodhisattva great beings practice the perfection of wisdom, if they see beings who are indolent and feeble in perseverance, they should encourage them through skill in means to adopt physical and mental perseverance, saying, ‘Noble children, in the emptiness of inherent existence there is nothing at all that becomes discouraged or indolent, and nothing at all with respect to which one becomes discouraged or indolent.

source: ཆོས་དེ་དག་ནི་ཐམས་ཅད་ཀྱང་རང་བཞིན་སྟོང་པ་ཉིད་ལས་མི་འདའ་བ་ཡིན་གྱིས།
en: All these phenomena do not go beyond the emptiness of inherent existence.

source: ལུས་དང་སེམས་ཀྱིས་བརྩོན་འགྲུས་སྐྱེད་ལ། ལེ་ལོ་འོར་ཏེ་དགེ་བའི་ཆོས་སྦྱིན་པ་འམ། ཚུལ་ཁྲིམས་སམ། བཟོད་པ་འམ། བརྩོན་འགྲུས་སམ། བསམ་གཏན་ནམ། ཤེས་རབ་བམ། ནང་སྟོང་པ་ཉིད་ད
en: So, cultivate physical and mental perseverance and reject indolence!

source: མ། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་རམ། དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་སམ། ཡང་དག་པར་སྤོང་བ་རྣམས་སམ། རྫུ་འཕྲུལ་གྱི་རྐང་པ་རྣམས་སམ། དབང་པོ་རྣམས་སམ། སྟོབས་རྣམས་སམ། བྱང་ཆུབ་ཀྱི་ཡན་ལག་རྣམས་སམ། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་འམ། འཕགས་པའི་བདེན་པ་རྣམས་སམ། བསམ་གཏན་རྣམས་སམ། ཚད་མེད་པ་རྣམས་སམ། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་སམ། རྣམ་པར་ཐར་པ་རྣམས་སམ། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་སམ། སྟོང་པ་ཉིད་དང་མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་འམ། མངོན་པར་ཤེས་པ་རྣམས་སམ། ཏིང་ངེ་འཛིན་རྣམས་སམ། གཟུངས་ཀྱི་སྒོ་རྣམས་སམ། དེ་བཞིན་གཤེགས་པའི་སྟོབས་རྣམས་སམ། མི་འཇིགས་པ་རྣམས་སམ། སོ་སོ་ཡང་དག་པར་རིག་པ་རྣམས་སམ། བྱམས་པ་ཆེན་པོ་འམ། སྙིང་རྗེ་ཆེན་པོ་འམ། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་དག་ལ་བརྩོན་པར་གྱིས་ཤིག །
en: Persevere in virtuous actions—whether in generosity, ethical discipline, tolerance, perseverance, meditative concentration, wisdom, the emptiness of internal phenomena, [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentity, the applications of mindfulness, the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, the noble eightfold path, the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, great loving kindness, great compassion, or the distinct qualities of the buddhas!

source: རིགས་ཀྱི་བུ་དག་སྟོང་པ་ཉིད་ཀྱིས་ཆོས་དེ་དག་ཐམས་ཅད་སྒྲིབ་པ་མེད་པར་རྟོགས་ཤིག །
en: Noble children, you should realize that all these phenomena are unobscured owing to emptiness.

source: སྒྲིབ་པ་མེད་པའི་ཆོས་ལ་ཞུམ་པར་འགྱུར་བ་གང་ཡང་མེད་དོ་ཞེས།
en: There should be no discouragement at all with respect to phenomena that are unobscured.’

source: རབ་འབྱོར་དེ་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཐབས་མཁས་པས་སེམས་ཅན་རྣམས་ལ་རང་བཞིན་སྟོང་པ་ཉིད་ཡང་དག་པར་སྟོན་ཏོ། །ཡང་དག་པར་སྐུལ་ལོ། །ཡང་དག་པར་གཟེང་བསྟོད་དོ། །ཡང་དག་པར་དགའ་བར་བྱེད་དོ། །གཞོག་གོ །
en: Subhūti, when bodhisattva great beings practice the perfection of wisdom in that manner, through skill in means they reveal to beings the emptiness of inherent existence, and encourage them, praise them, rejoice with them, settle them, discipline them, and establish them in it.

source: འདུལ་ལོ། །རབ་ཏུ་འགོད་དོ། །ཅི་ནས་ཀྱང་གཉིས་ལ་མི་གནས་པ་དེ་ལྟར་རབ་ཏུ་འགོད་དོ།
en: In every way they establish them so that they do not dwell in duality.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། རང་བཞིན་སྟོང་པ་ཉིད་ནི་གཉིས་སུ་མེད་དེ་གཉིས་སུ་བྱར་མེད་དོ།
en: If you ask why, the emptiness of inherent existence is indivisible and cannot be divided in two.

source: །གཉིས་སུ་མེད་པའི་ཆོས་ནི་གང་ལ་ཡང་གནས་པ་མེད་དོ།
en: Phenomena that are without duality do not dwell in anything at all. “

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཐབས་མཁས་པས་སེམས་ཅན་རྣམས་ལ་རང་བཞིན་སྟོང་པ་ཉིད་ཀྱི་བརྩོན་འགྲུས་ལ་འདེམས་ཤིང་རྗེས་སུ་སྟོན་ཏེ། ཚུར་རིགས་ཀྱི་བུ་སྦྱིན་པ་འམ། ཚུལ་ཁྲིམས་སམ། བཟོད་པ་འམ།
en: Moreover, Subhūti, when bodhisattva great beings practice the perfection of wisdom, through skill in means they should instruct and advise beings to persevere with the emptiness of inherent existence, saying, ‘Come here, noble children!

source: བརྩོན་འགྲུས་སམ། བསམ་གཏན་ནམ། ཤེས་རབ་བམ། ནང་སྟོང་པ་ཉིད་དམ། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་རམ། དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་སམ། ཡང་དག་པར་སྤོང་བ་རྣམས་སམ། རྫུ་འཕྲུལ་གྱི་རྐང་པ་རྣམས་སམ། དབང་པོ་རྣམས་སམ།
en: You should undertake perseverance, whether in the context of generosity, ethical discipline, tolerance, perseverance, meditative concentration, wisdom, the emptiness of internal phenomena, [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentity, the applications of mindfulness, {Ki.

source: སྟོབས་རྣམས་སམ། བྱང་ཆུབ་ཀྱི་ཡན་ལག་རྣམས་སམ། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་འམ། འཕགས་པའི་བདེན་པ་རྣམས་སམ། བསམ་གཏན་རྣམས་སམ། ཚད་མེད་པ་རྣམས་སམ། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་སམ། རྣམ་པར་ཐར་པ་རྣམས་སམ། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་སམ། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་འམ། མངོན་པར་ཤེས་པ་རྣམས་སམ། ཏིང་ངེ་འཛིན་རྣམས་སམ། གཟུངས་ཀྱི་སྒོ་རྣམས་སམ། དེ་བཞིན་གཤེགས་པའི་སྟོབས་རྣམས་སམ། མི་འཇིགས་པ་རྣམས་སམ། སོ་སོ་ཡང་དག་པར་རིག་པ་རྣམས་སམ། བྱམས་པ་ཆེན་པོ་འམ། སྙིང་རྗེ་ཆེན་པོ་འམ།
en: VIII: 93} the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, the noble eightfold path, the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, the dhāraṇī gateways, the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, great loving kindness, great compassion, or the distinct qualities of the buddhas.

source: སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་དག་ལ་བརྩོན་འགྲུས་རྩོམས་ལ། ཆོས་དེ་དག་གཉིས་པར་ཡང་ཡིད་ལ་མ་བྱེད་ཅིག །མི་གཉིས་པར་ཡང་ཡིད་ལ་མ་བྱེད་ཅིག །
en: You should not, however, focus attention on them in terms of duality.

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཆོས་དེ་དག་ནི་རང་བཞིན་གྱིས་སྟོང་པ་སྟེ།
en: If you ask why, these phenomena are empty of inherent existence.

source: རང་བཞིན་གྱིས་སྟོང་པ་ཉིད་ནི་གཉིས་པར་ཡིད་ལ་བྱ་བ་མ་ཡིན། མི་གཉིས་པར་ཡང་ཡིད་ལ་བྱ་བ་མ་ཡིན་ནོ།
en: One should not focus attention on the emptiness of inherent existence in terms of duality, nor should one focus attention on it in terms of nonduality.’

source: །རབ་འབྱོར་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཐབས་མཁས་པས་སེམས་ཅན་རྣམས་རང་བཞིན་སྟོང་པ་ཉིད་ལ་ཡོངས་སུ་སྨིན་པར་བྱེད་དེ། ཡོངས་སུ་སྨིན་པར་བྱས་ནས། རིམ་གྱིས་རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་དང་། ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་དང་། ཕྱིར་མི་འོང་བའི་འབྲས་བུ་དང་།
en: Subhūti, when bodhisattva great beings practice the perfection of wisdom in that manner, through skill in means they bring beings to maturation in the emptiness of inherent existence, and having brought them to maturation, they gradually establish them in the fruit of entering the stream to nirvāṇa, the fruit of being destined for only one more rebirth, the fruit of no longer being subject to rebirth, arhatship, and individual enlightenment.

source: དགྲ་བཅོམ་པ་ཉིད་དང་། རང་བྱང་ཆུབ་ལ་འགོད་དོ། །ལམ་གྱི་རྣམ་པ་ཤེས་པ་ཉིད་དང་། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་འགོད་དོ།
en: They establish them in knowledge of the path and in unsurpassed, complete enlightenment. “

source: །རབ་འབྱོར་གཞན་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཐབས་མཁས་པས་སེམས་ཅན་སེམས་གཡེང་བ་རྣམས་ལ་འདི་སྐད་དུ་འདེམས་ཤིང་རྗེས་སུ་སྟོན་ཏེ།
en: Moreover, Subhūti, when bodhisattva great beings practice the perfection of wisdom, through skill in means they should instruct and advise beings whose minds are distracted, saying, ‘Come here, noble children!

source: ཚུར་རིགས་ཀྱི་བུ་ཏིང་ངེ་འཛིན་སྒོམས་ཤིག །
en: Cultivate meditative stability!

source: གཡེང་བའི་འདུ་ཤེས་སམ། ཏིང་ངེ་འཛིན་གྱི་འདུ་ཤེས་སུ་མ་བྱེད་ཅིག །
en: Do not entertain notions about distraction or notions about meditative stability!

source: རང་བཞིན་སྟོང་པ་ཉིད་ལ་ནི་གང་གཡེང་བ་འམ། རྩེ་གཅིག་ཏུ་འགྱུར་བའི་ཆོས་གང་ཡང་དམིགས་སུ་མེད་དོ། །ཁྱོད་ཀྱིས་ཏིང་ངེ་འཛིན་དེ་ལ་གནས་ཏེ། རང་བཞིན་སྟོང་པ་ཉིད་ལ་སྤྱད་ན། ལུས་དང་ངག་དང་། ཡིད་ཀྱིས་དགེ་བའི་ཆོས་གང་ཅི་བྱེད་ཀྱང་རུང་སྟེ། སྦྱིན་པ་གཏོང་ངམ། ཚུལ་ཁྲིམས་སྲུང་ངམ། བཟོད་པ་སྒྲུབ་བ་བམ། བརྩོན་འགྲུས་རྩོམ་མམ། ཏིང་ངེ་འཛིན་སྐྱེད་དམ། ཤེས་རབ་སྒོམ་འམ། ནང་སྟོང་པ་ཉིད་ལ་སྤྱོད་དམ། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་ལ་སྤྱོད་དམ། དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་དང་། ཡང་དག་པར་སྤོང་བ་རྣམས་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པ་རྣམས་དང་། དབང་པོ་རྣམས་དང་། སྟོབས་རྣམས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་རྣམས་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ལ་སྤྱོད་དམ། འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་རྣམས་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་ལ་སྤྱོད་དམ། དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། བྱམས་པ་ཆེན་པོ་དང་།
en: In the emptiness of inherent existence nothing at all is apprehended that is distracted or one-pointed.
